# массивы(списки) кортежи объекты(словари) множества
массивы 71

создание пустого массива
преобразование в списки
получение элемента и элементов
добавление элемента в список
объединение списков
...

кортежи 81

объекты 83

множества 91

# корочка стр 100

комментарии
условия
сравнения
циклы
числовые последовательности

# функции 118
передача аргументов
замыкания 129
генераторы
обработка ошибок 137

# модули пакеты 142
выдергивание командной строки через библиотеку sys
модули - код из других файлов
обработка отсутствующих ключей объекты
подсчет элементов в объекте
порядок по ключу
двухсторонняя очередь
итертулс для похода по структурам кода
библиотека выравнивания элементов объекта

# объекты и классы 157

# работа с данными 180
преобразование строк в unicode символы
кодировка UTF - 8
типы кодировок 185
форматирование символов 190
регулярные выражения 192
шаблоны 197
бинарные данные 200
bytes bytearray 

битовые операторы 206

# Данные куда-то падают 210

открытие файла:
    чтение
    запись
    запись и сохранение
    добавление в конец файла

запись в текстовый файл


















