

консоль браузера

создание переменных
правильные имена переменных
константы

типы данных
числа
bigint
числа с плавающей точкой
NaN
null
undefined
[]
{}
Symbol
true false
string
typeof

вызов окна с вопросом
(Окно ОК ОТМЕНА)
вызов окна с подтвеждением
(ОК ОТМЕНА)

перевод данных в строку, число, Boolean

сложение
вычитание
умножение
возведение в степень
получение остатка

сложение строк
перевод в число + перед перменной

сокращенная запись сложения и приравнивания

инкремент
декремент
сравнение
проверка равенства

условие
несколько условий
иначе

тернарный оператор

или
и
нулевое слияние
опциональная цепочка

циклы
остановка и продолжение

выбор опции из кейсов

функции
локальные переменные
внешние переменные
параметры
параметры по умолчанию
возврат значения

неименованная функция
именованная функция
стрелочные функции

отладка в браузере

объекты
ключи и значения
доступ к ключам и значениям
вычисляемые свойства
проверка существования свойства
цикл по ключам
упорядочение свойств объекта
копирование по ссылке
клонирование объекта
сборка мусора
методы
this
не фиксирован
стрелочные без него
конструктор new
new.target проверка создания объекта
опциональная цепочка ?.

Symbol
скрытые свойства
символ в объекте
не в цикле
глобальные символы
ключ по символам

объекты в примитивы

методы примитивов

числа
сокращенная запись нулей
двоичная
восьмеричная
шестнадцатиричная
перевод в строку
округление чисел
бесконечность
ошибки при 0.1 0.2
убрать нужно количество после точки
и округлить
проверка на не число
проверка на число
убрать все кроме целого числа
убрать все кроме числа с точкой
рандом
максимальное
минимальное
в степень

строки
типы строк
спецсимволы перенос табуляция
обращение к символам строки
неизменяемость строк
изменение регистра
поиск подстроки
проверка наличия в строке
проверка начала и окончания
срез строки
сравнение

массивы
создание массива
обращение к элементам
длина
последние элементы at
получение последнего
добавление последнего
получение первого
добавление первого
перебор элементов
многомерные массивы
перевод в строку
сравнение по ссылке
вырезание элементов
объединение массивов
перебор forEach
поиск
фильтр
преобразование
сортировка
разворот
работа со всеми элементами
проверка на массив

перебираемые объекты

map set и ключи
weakmap weakset

перебор ключей значений и пар

деструктуризация в массивах и {}

дата и время

формат JSON 
перевод в json и чтение из него

рекурсия и стек

оператор расширения

области видимости и замыкание



























