тег скрипт для работы кода js
типы скриптов
внешние скрипты

вызов окна в браузере с предупреждением
(можно нажать ОК)

комментарии

строгий режим для устранения ошибок
консоль браузера

создание переменных
правильные имена переменных
константы

типы данных
числа
bigint
числа с плавающей точкой
NaN
null
undefined
[]
{}
Symbol
true false
string
typeof

вызов окна с вопросом
(Окно ОК ОТМЕНА)
вызов окна с подтвеждением
(ОК ОТМЕНА)

перевод данных в строку, число, Boolean

сложение
вычитание
умножение
возведение в степень
получение остатка

сложение строк
перевод в число + перед перменной

сокращенная запись сложения и приравнивания

инкремент
декремент
сравнение
проверка равенства

условие
несколько условий
иначе

тернарный оператор

или
и
нулевое слияние
опциональная цепочка

циклы
остановка и продолжение

выбор опции из кейсов

функции
локальные переменные
внешние переменные
параметры
параметры по умолчанию
возврат значения

неименованная функция
именованная функция
стрелочные функции



























