GROUP BY
группировки строк таблицы по одному или нескольким столбцам

Преимущество связанного списка перед массивом
Эффективные вставки/удаления

Какая сложность у пузырьковой сортировки в худшем случае
O(n²)

Какой протокол используется для загрузки файлов
FTP (File Transfer Protocol)

стек
Структура данных с принципом LIFO

операция "enqueue" в очереди
Добавляет элемент в конец

HTTP с шифрованием
HTTPS

бинарный поиск
Делит отсортированный массив пополам для поиска

жадный
Краскала

СУБД реляционная
PostgreSQL

все записи из таблицы users
SELECT * FROM users

Хеш-таблица — это
структура, сопоставляющая ключи значениям

NAT
Технология трансляции адресов между внутренней и внешней сетями

HTTPS
443

деревья
Хранение иерархических данных

FIFO
First In, First Out Очередь

индекс в базе данных
это структура, которая ускоряет поиск данных

нормализация
Устранение избыточности и дублирования

INNER JOIN
Объединяет таблицы по совпадающим значениям

Первичный ключ
Уникальный идентификатор строки

DROP TABLE делает
Удаляет таблицу и данные

UDP отличается от TCP
Не устанавливает соединение

TCP
Протокол с установлением соединения

IP-адрес
Уникальный идентификатор устройства

SMTP
SMTP используется для отправки email

Переполнении стека вызовов
Stack Overflow

Что делает алгоритм сортировки вставками
Вставляет элемент на своё место в отсортированной части