#создать список
a = []
print(a)
#создать список
a1 = list()
print(a1)
#из строки в список
print(list('abc'))
#из строки в список
print('a,b,c'.split(','))
#получить элемент
print([1,2,3][0])
#получить первые два элеманта
print([1,2,3][0:2])
#добавить
a2 = [1,2,3]
a2.append(4)
print(a2)
#размножить
print([1]*3)
#сложить
print([1]+[2])
#изменить элементы
a3=[1,2,3,4]
a3[1:3]=[5,6]
print(a3)
#удаляем элемент
a4=[1,2,3]
a4.remove(2)
print(a4)
#удаляем элемент
a5=[1,2,3]
print(a5.pop())
#очищаем
a6=[1,2,3]
a6.clear()
print(a6)
#индекс
print([1,2].index(2))
#проверка наличия
if 1 in [1,2]: print(True)
#количество
print([1,1,1].count(1))
#сортировка
a8 = [3,2,1]
a8.sort()
print(a8)
#неск массивов
a9=[1,2,3]
a10=[4,5,6]
for x in zip(a9,a10):
    print(x)

