223 
создание папки
определение содержимого и размеров папки
открытие файла
чтение содержимого
запись в файл
ПРОЕКТ: создание билетов на экзамен
(Использовать для Курбатовой)
254
копирование файлов и папок
перемещение файлов и папок
переименовывание файлов и папок
чтение зип файлов
извлечение зип файлов
создание зип и добавление в них файлов
ПРОЕКТ: замена американского формата дат европейский
ПРОЕКТ: резервная копия файлов в зипе
(Использовать на раб компе)
276
Возбуждение исключений
Обратная трассировка
Утверждения
Протоколирование
Отладчик IDLE
Точки останова
11 глава
Сбор данных
определение урла
обработка аргументов командной строки
обработка содержимого буфера обмена
загрузка файлов из инета
- [ ] Использовать для нашего сайта 
Сохранение файлов на жестком диске
О HTML
Анализ HTML с помощью Beautiful soup
Поиск элемента
ПРОЕКТ: кнопка мне повезет
ПРОЕКТ: загрузка всех комиксов с сайта

Управление SELENIUM
запуск браузера
поиск элементов
щелчок по странице
- [ ] Проверить на маке
заполнение и отправка форм
отправка кодов спец клавиш
щелчок на кнопках браузера

РАБОТА Excel
МОДУЛЬ openpyxl
получение списка листов
получение ячеек рабочих листов
преобразования между буквенными и цифровыми обозначениями
ПРОЕКТ: чтение данных
Запись данных в Excel
Создание и удаление рабочих листов
Запись значений в ячейки
ПРОЕКТ: обновление электронной таблицы
Настройка типа шрифтов
Объекты FONT
Формулы
Настройка высоты и ширины столбцов
Слияние ячеек
Закрепление областей
Построение диаграм
ПРОЕКТ: Генератор таблиц умножения
Программа для вставки пустых строк
Отражение электронной таблицы

PDF
Извлечение из PDF
Дешифрование PDF
Создание PDF
Копирование страниц
Поворот страниц
Наложение страниц
Шифрование PDF 
ПРОЕКТ: Объединение выбранных страниц

WORD
Чтение документов
Получение полного текста
Стилевое оформление абзаца
Создание документов WORD
Атрибуты RUN
Запись в WORD
Добавление заголовков
Добавление разрывов строк
Добавление изображений

ПРОЕКТЫ
взлом пароля pdf
паранойа пдф

CSV
объекты reader
объекты writer
именованные аргументы
ПРОЕКТ: удаление заголовков из csv

JSON
ПРОЕКТ: получение прогноза погоды
ПРОЕКТ: из csv в excel

ДАТА И ВРЕМЯ
ПРОЕКТ: СЕКУНДОМЕР С ОСТАНОВКОЙ
ЗАПУСК других программ

ПОЧТА
Отправка сообщений почты
Извлечение писем из почты и снабжение писем меткой
Получение адресов электронной почты из сырых сообщений
Удаление сообщений
ПРОЕКТ: рассылка на почту
ПРОЕКТ: Черкни мне 

ИЗОБРАЖЕНИЯ
БИБЛИОТЕКА Pillow
Обрезка изображений
Изображение в другие изображения
Изменение размеров
Поворот/зеркальное
Изменение пикселей
ПРОЕКТ: Добавление логотипа
Рисование фигур/текста

Управление клавиатурой и мышью
МОДУЛЬ pyatogui
Паузы
Управление перемещением
Получение позиции указателя
Щелчки мышью
Перетаскивание указателя
Прокрутка страницы
Получение снимка экрана
Анализ снимка
Распознавание образов

Управление клавиатурой
Обозначение клавиш
Горячие клавиши
ПРОЕКТ: автоматическое заполнение формы

	
УСТАНОВКА МОДУЛЕЙ